Gekkotron/OpenQuarkyRover/firmware/sdkconfig.defaults
# Target and flash — matches the ESP32-S3-WROOM-1-N16R8 module on the
# Quarky Intellio (verified via `esptool chip-id` + `esptool image-info`
# on the stock firmware).

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Console on UART0 — the board has a USB-to-serial bridge (device shows
# up as /dev/cu.usbserial-*), NOT native USB-JTAG. Default UART console
# is what `idf.py monitor` expects here.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Give app_main a comfortable stack. The REPL runs in its own task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM: enabled for the M2 web UI so the OV5640 camera can allocate its
# JPEG framebuffers there instead of the constrained internal DRAM.
# N16R8 = 16 MB flash + 8 MB octal PSRAM (AP Memory, AP_3v3, 85 °C rated).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Custom partition table — see firmware/partitions.csv. Reserves a
# 6 MB "model" partition that esp-sr's CMake auto-flashes with the
# selected WakeNet/MultiNet models, plus a 2 MB factory app.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# esp-sr WakeNet: English "Hi ESP" wake word.
# esp-sr MultiNet7 English (quantized) for post-wake command recognition.
# Other wake words and VAD stay at defaults; srmodels.bin ends up ~1 MB.
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
